ee = "新浪微博是一款为大众提供娱乐休闲生活服务的信息分享和交流平台。新浪微博于2009年8月14日开始内测，9月25日，新浪微博正式添加了@功能以及私信功能，此外还提供“评论”和“转发”功能，供用户交流。
新浪微博采用了与新浪博客一样的推广策略，即邀请明星和名人加入开设微型博客，并对他们进行实名认证，认证后的用户在用户名后会加上一个字母“V”（认证个人字母V为金黄色，认证企业字母V为深蓝色），以示与普通用户的区别，同时也可避免冒充名人微博的行为，但微博功能和普通用户是相同的。
于2009年8月14日开始内测，2009
新浪与阿里巴巴
新浪与阿里巴巴
年11月3日，Sina App Engine Alpha版上线，可通过API用第三方软件或插件发布信息。截至2014年3月，微博月活跃用户1.438亿，日活跃用户6660万，其中包括大量政府机构、官员、企业、个人认证账号，开放的传播机制使新浪微博成为中国的“公共议事厅”。[3] 
发展简史
编辑
2009年7月，经过一个多月的调研分析，管理层明确了目标，下决心要做微博这个产品，由两年前进入新浪、时任桌面产品事业部主管的彭少彬主持开发。
彭少彬
彭少彬
2010年初，新浪微博推出API开放平台。虎年伊始，百度百科也推出了“分享到新浪微博”的新功能。细心的科友可以发现，在百科词条页的下方，新增了“分享到新浪微博”的按钮。[4] 
根据2010年官方公布数据显示，新浪微博每天发博数超过2500万条，其中有38%来自于移动终端。每天发布微博数量超过两千五百万条，微博总数累计超过20亿条。是国内最有影响力、最受瞩目的微博运营商。[4] 
2010年10月27日推出中国首届微小说大赛。
2010年11月5日，新浪微博群组功能产品——新浪微群已开始内测，微群产品具备了通讯与媒体传播的双重功能，被视作为网页版的“QQ群”。
2010年11月16日，“2010中国首届微博开发者大会”由新浪微博主办、CSDN协办，在国家会议中心举行。
2011年3月，启用短域名t点cn服务，用户微博发布链接从原先将缩略成带有t点cn的短链接。t国内cn域名替换sinaurl之后，用户在新浪发布的链接将会更短，这样可减少占用到微博的140个字的限制，此前，国外著名博客Twitter采用了t点co推出缩短网址服务。
2011年4月，新浪微博独立启用微博拼音域名weibo国际域名
新浪微博页面
新浪微博页面
，同时启动新版LOGO标识，新浪微博将进入双域名并存阶段，访问原域名也可登录微博，weibo全拼国际域名开始转发原域名，在此之前weibo点com转发至微博开放平台。
2011年5月，新浪微博已将原先的链接正式跳转weibo点com，至此，新浪微博正式结束双域名并存战略局面，用户地址也显认变成weibo点com/###。[5] 
2011年6月3日，新浪微博正在积极筹备英文版，进军美国市场，时间就在两三个月内。
2012年1月5日，新浪微博的又一个新功能——悄悄关注，正式上线。
2013年1月11日，新浪微博与网易有道达成战略合作，网易有道将成为新浪微博首家翻译合作伙伴，为超过4亿用户提供免费外语微博翻译服务。[6] 
2013年1月31日，新浪微博客户端推出3.3.0版本(包括iPhone版本、Android)，新增“密友”功能强化私密社交圈。[7] 
微博营销大会
微博营销大会
2013年2月20日，，新浪公布财报，新浪微博的总收入约为6600万美元。截至2012年12月底，新浪微博注册用户数超过5亿，同比增长74%；日活跃用户数达到4620万，领跑中国最大的社交圈。
2013年4月29日，新浪公司(以下简称“新浪”)其子公司微博公司(以下简称“微博”)与阿里巴巴集团(简称“阿里巴巴”)的子公司【阿里巴巴(中国)】，签署战略合作协议。[8] 
2013年8月1日，新浪微博与淘宝将在京召开产品合作发布会，推出新浪微博淘宝版，实现账号互通，淘宝卖家可在新浪微博淘宝版直接发布商品，并通过后台进行商品管理及商情监控。
2013年10月29日，以用户主动订阅为基础的新浪微博“粉丝服务平台”正式上线，所有认证用户均可申请使用。粉丝服务平台将帮助认证用户为主动订阅他的粉丝提供精彩内容和互动服务，被视为推动微博由“营销”平台向“营销+服务”平台转型的重要产品。与此同时，粉丝服务平台宣布推出开发者模式，对第三方开发者全面开放。[9] 
2014年3月27日晚间，新浪微博左上角的LOGO悄然更换，原有的“新浪”二字消失不见，却而代之的是更大字号的“微博”字样。截止目前，“新浪微博”称谓已经使用4年多时间。[10] 
2014年3月15日，新浪微博正式向美国证券交易委员会提交了上市申请文件，计划融资5亿美元，迈出了上市的重要一步。招股书显示，新浪微博的机构股东中，新浪集团持1.4亿股，占比77.6%；阿里巴巴持3489万股,占比19.3%。招股书中，新浪微博名称为“Weibo Corporation”，LOGO上的文字也仅有“weibo”字样。
2014年3月17日晚9点半，新浪微博正式登陆纳斯达克，新浪CEO、新"
library(jiebaR)
cc =worker() 
ress = get_tuple(cc[ee],dataframe = T)
head(ress)

